# 필터링 데이터 딕셔너리
def getFiltering_dic(university_name):
  if (university_name == '한국과학기술원'):
    filtering_dic={
      "과목구분": ['과목구분'],
      "과정구분": ['과정구분'],
      "강의고유번호": ['학수번호', '과목번호', '학정번호', '강좌코드', '교과목교과목'],
      "강의명": ['과목명', '강좌명'], 
      "교수명": ['교강사', '교수'],
      "학년":["학년"],
      "학점": ['학점'],
      "이수구분": ['구분', '종별'],
      "강의시간": ['시간'],
      "강의실": ['강의실'],
      "특이사항": ['특이사항', '유의사항', '비고'],
    }
  else:
    filtering_dic={
      "강의고유번호": ['학수번호', '과목번호', '학정번호', '강좌코드', '교과목교과목'],
      "강의명": ['과목명', '강좌명'],
      "교수명": ['교강사', '교수'],
      "학년":["학년"],
      "학점": ['학점'],
      "이수구분": ['구분', '종별'],
      "강의시간": ['시간'],
      "강의실": ['강의실'],
      "특이사항": ['특이사항', '유의사항', '비고'],
    }
    
  return filtering_dic