# 정규표현식 딕셔너리
regular_expression={
  "경희대학교": [
    '(?:(?:[월화수목금토일]|)(?:(?:\s|)(?:\d{2}:\d{2}|)-(?:\d{2}:\d{2}|)))',                #추출 정규표현식---[0] / 분리되어 있을 시  '(?:\w|\W)' 입력
    '(?:(?:(?:[월화수목금토일]|)(?:(?:\s|)(?:\d{2}:\d{2}|)-(?:\d{2}:\d{2}|)))|\(|\))'       #제거 정규표현식---[1] / 분리되어 있을 시  ''          입력
    ],
  "고려대학교": [
    '(?:[월화수목금토일]\((?:\d{2}|\d{1})(?:-(?:\d{2}|\d{1})|))\)',
    '(?:[월화수목금토일]\((?:\d{2}|\d{1})(?:-(?:\d{2}|\d{1})|))\)'
    ],
  "연세대학교": [     #분리되어있음
    '(?:\w|\W)',
    ''
    ], 
  "성균관대학교": [   #강의실 컬럼 X
    '(?:\w|\W)',
    ''
    ], 
  "국민대학교": [    #강의실 컬럼 X
    '(?:\w|\W)',
    ''
    ], 
  "한국과학기술원": [   #분리되어있음
    '(?:\w|\W)',
    ''
    ], 
  "한양대학교": [     #분리되어있음
    '(?:\w|\W)',
    ''
    ], 
}